espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/cache_struct.h
/** Type of l2_cache_autoload_sct0_addr register
 *  L2 Cache autoload section 0 address configure register
 */
typedef union {
    struct {
        /** l2_cache_autoload_sct0_addr : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the first section for
         *  autoload operation on L2-Cache. Note that it should be used together with
         *  L2_CACHE_AUTOLOAD_SCT0_SIZE and L2_CACHE_AUTOLOAD_SCT0_ENA.
         */
        uint32_t l2_cache_autoload_sct0_addr:32;
    };
    uint32_t val;
} cache_l2_cache_autoload_sct0_addr_reg_t;

/** Type of l2_cache_autoload_sct0_size register
 *  L2 Cache autoload section 0 size configure register
 */
typedef union {
    struct {
        /** l2_cache_autoload_sct0_size : R/W; bitpos: [27:0]; default: 0;
         *  Those bits are used to configure the size of the first section for autoload
         *  operation on L2-Cache. Note that it should be used together with
         *  L2_CACHE_AUTOLOAD_SCT0_ADDR and L2_CACHE_AUTOLOAD_SCT0_ENA.
         */
        uint32_t l2_cache_autoload_sct0_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l2_cache_autoload_sct0_size_reg_t;

/** Type of l2_cache_autoload_sct1_addr register
 *  L2 Cache autoload section 1 address configure register
 */
typedef union {
    struct {
        /** l2_cache_autoload_sct1_addr : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the second section
         *  for autoload operation on L2-Cache. Note that it should be used together with
         *  L2_CACHE_AUTOLOAD_SCT1_SIZE and L2_CACHE_AUTOLOAD_SCT1_ENA.
         */
        uint32_t l2_cache_autoload_sct1_addr:32;
    };
    uint32_t val;
} cache_l2_cache_autoload_sct1_addr_reg_t;

/** Type of l2_cache_autoload_sct1_size register
 *  L2 Cache autoload section 1 size configure register
 */
typedef union {
    struct {
        /** l2_cache_autoload_sct1_size : R/W; bitpos: [27:0]; default: 0;
         *  Those bits are used to configure the size of the second section for autoload
         *  operation on L2-Cache. Note that it should be used together with
         *  L2_CACHE_AUTOLOAD_SCT1_ADDR and L2_CACHE_AUTOLOAD_SCT1_ENA.
         */
        uint32_t l2_cache_autoload_sct1_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l2_cache_autoload_sct1_size_reg_t;

/** Type of l2_cache_autoload_sct2_addr register
 *  L2 Cache autoload section 2 address configure register
 */
typedef union {
    struct {
        /** l2_cache_autoload_sct2_addr : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the third section for
         *  autoload operation on L2-Cache. Note that it should be used together with
         *  L2_CACHE_AUTOLOAD_SCT2_SIZE and L2_CACHE_AUTOLOAD_SCT2_ENA.
         */
        uint32_t l2_cache_autoload_sct2_addr:32;
    };
    uint32_t val;
} cache_l2_cache_autoload_sct2_addr_reg_t;

/** Type of l2_cache_autoload_sct2_size register
 *  L2 Cache autoload section 2 size configure register
 */
typedef union {
    struct {
        /** l2_cache_autoload_sct2_size : R/W; bitpos: [27:0]; default: 0;
         *  Those bits are used to configure the size of the third section for autoload
         *  operation on L2-Cache. Note that it should be used together with
         *  L2_CACHE_AUTOLOAD_SCT2_ADDR and L2_CACHE_AUTOLOAD_SCT2_ENA.
         */
        uint32_t l2_cache_autoload_sct2_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l2_cache_autoload_sct2_size_reg_t;

/** Type of l2_cache_autoload_sct3_addr register
 *  L2 Cache autoload section 3 address configure register
 */
typedef union {
    struct {
        /** l2_cache_autoload_sct3_addr : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the fourth section
         *  for autoload operation on L2-Cache. Note that it should be used together with
         *  L2_CACHE_AUTOLOAD_SCT3_SIZE and L2_CACHE_AUTOLOAD_SCT3_ENA.
         */
        uint32_t l2_cache_autoload_sct3_addr:32;
    };
    uint32_t val;
} cache_l2_cache_autoload_sct3_addr_reg_t;

/** Type of l2_cache_autoload_sct3_size register
 *  L2 Cache autoload section 3 size configure register
 */
typedef union {
    struct {
        /** l2_cache_autoload_sct3_size : R/W; bitpos: [27:0]; default: 0;
         *  Those bits are used to configure the size of the fourth section for autoload
         *  operation on L2-Cache. Note that it should be used together with
         *  L2_CACHE_AUTOLOAD_SCT3_ADDR and L2_CACHE_AUTOLOAD_SCT3_ENA.
         */
        uint32_t l2_cache_autoload_sct3_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l2_cache_autoload_sct3_size_reg_t;


/** Group: Interrupt registers */
/** Type of l1_cache_acs_cnt_int_ena register
 *  Cache Access Counter Interrupt enable register
 */
typedef union {
    struct {
        /** l1_ibus0_ovf_int_ena : R/W; bitpos: [0]; default: 0;
         *  The bit is used to enable interrupt of one of counters overflow that occurs in
         *  L1-ICache0 due to bus0 accesses L1-ICache0.
         */
        uint32_t l1_ibus0_ovf_int_ena:1;
        /** l1_ibus1_ovf_int_ena : R/W; bitpos: [1]; default: 0;
         *  The bit is used to enable interrupt of one of counters overflow that occurs in
         *  L1-ICache1 due to bus1 accesses L1-ICache1.
         */
        uint32_t l1_ibus1_ovf_int_ena:1;
        /** l1_ibus2_ovf_int_ena : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus2_ovf_int_ena:1;
        /** l1_ibus3_ovf_int_ena : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus3_ovf_int_ena:1;
        /** l1_dbus0_ovf_int_ena : R/W; bitpos: [4]; default: 0;
         *  The bit is used to enable interrupt of one of counters overflow that occurs in
         *  L1-DCache due to bus0 accesses L1-DCache.
         */
        uint32_t l1_dbus0_ovf_int_ena:1;
        /** l1_dbus1_ovf_int_ena : R/W; bitpos: [5]; default: 0;
         *  The bit is used to enable interrupt of one of counters overflow that occurs in
         *  L1-DCache due to bus1 accesses L1-DCache.
         */
        uint32_t l1_dbus1_ovf_int_ena:1;
        /** l1_dbus2_ovf_int_ena : HRO; bitpos: [6]; default: 0;
         *  Reserved
         */
        uint32_t l1_dbus2_ovf_int_ena:1;
        /** l1_dbus3_ovf_int_ena : HRO; bitpos: [7]; default: 0;
         *  Reserved
         */
        uint32_t l1_dbus3_ovf_int_ena:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} cache_l1_cache_acs_cnt_int_ena_reg_t;

/** Type of l1_cache_acs_cnt_int_clr register
 *  Cache Access Counter Interrupt clear register
 */
typedef union {
    struct {
        /** l1_ibus0_ovf_int_clr : WT; bitpos: [0]; default: 0;
         *  The bit is used to clear counters overflow interrupt and counters in L1-ICache0 due
         *  to bus0 accesses L1-ICache0.
         */
        uint32_t l1_ibus0_ovf_int_clr:1;
        /** l1_ibus1_ovf_int_clr : WT; bitpos: [1]; default: 0;
         *  The bit is used to clear counters overflow interrupt and counters in L1-ICache1 due
         *  to bus1 accesses L1-ICache1.
         */
        uint32_t l1_ibus1_ovf_int_clr:1;
        /** l1_ibus2_ovf_int_clr : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus2_ovf_int_clr:1;
        /** l1_ibus3_ovf_int_clr : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus3_ovf_int_clr:1;
        /** l1_dbus0_ovf_int_clr : WT; bitpos: [4]; default: 0;
         *  The bit is used to clear counters overflow interrupt and counters in L1-DCache due
         *  to bus0 accesses L1-DCache.
         */
        uint32_t l1_dbus0_ovf_int_clr:1;
        /** l1_dbus1_ovf_int_clr : WT; bitpos: [5]; default: 0;
         *  The bit is used to clear counters overflow interrupt and counters in L1-DCache due
         *  to bus1 accesses L1-DCache.
         */
        uint32_t l1_dbus1_ovf_int_clr:1;
        /** l1_dbus2_ovf_int_clr : HRO; bitpos: [6]; default: 0;
         *  Reserved
         */
        uint32_t l1_dbus2_ovf_int_clr:1;
        /** l1_dbus3_ovf_int_clr : HRO; bitpos: [7]; default: 0;
         *  Reserved
         */
        uint32_t l1_dbus3_ovf_int_clr:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} cache_l1_cache_acs_cnt_int_clr_reg_t;

/** Type of l1_cache_acs_cnt_int_raw register
 *  Cache Access Counter Interrupt raw register
 */
typedef union {
    struct {
        /** l1_ibus0_ovf_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache0
         *  due to bus0 accesses L1-ICache0.
         */
        uint32_t l1_ibus0_ovf_int_raw:1;
        /** l1_ibus1_ovf_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache1
         *  due to bus1 accesses L1-ICache1.
         */
        uint32_t l1_ibus1_ovf_int_raw:1;
        /** l1_ibus2_ovf_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache2
         *  due to bus2 accesses L1-ICache2.
         */
        uint32_t l1_ibus2_ovf_int_raw:1;
        /** l1_ibus3_ovf_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache3
         *  due to bus3 accesses L1-ICache3.
         */
        uint32_t l1_ibus3_ovf_int_raw:1;
        /** l1_dbus0_ovf_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache
         *  due to bus0 accesses L1-DCache.
         */
        uint32_t l1_dbus0_ovf_int_raw:1;
        /** l1_dbus1_ovf_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache
         *  due to bus1 accesses L1-DCache.
         */
        uint32_t l1_dbus1_ovf_int_raw:1;
        /** l1_dbus2_ovf_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache
         *  due to bus2 accesses L1-DCache.
         */
        uint32_t l1_dbus2_ovf_int_raw:1;
        /** l1_dbus3_ovf_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache
         *  due to bus3 accesses L1-DCache.
         */
        uint32_t l1_dbus3_ovf_int_raw:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} cache_l1_cache_acs_cnt_int_raw_reg_t;

/** Type of l1_cache_acs_cnt_int_st register
 *  Cache Access Counter Interrupt status register
 */
typedef union {
    struct {
        /** l1_ibus0_ovf_int_st : RO; bitpos: [0]; default: 0;
         *  The bit indicates the interrupt status of one of counters overflow that occurs in
         *  L1-ICache0 due to bus0 accesses L1-ICache0.
         */
        uint32_t l1_ibus0_ovf_int_st:1;
        /** l1_ibus1_ovf_int_st : RO; bitpos: [1]; default: 0;
         *  The bit indicates the interrupt status of one of counters overflow that occurs in
         *  L1-ICache1 due to bus1 accesses L1-ICache1.
         */
        uint32_t l1_ibus1_ovf_int_st:1;
        /** l1_ibus2_ovf_int_st : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus2_ovf_int_st:1;
        /** l1_ibus3_ovf_int_st : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus3_ovf_int_st:1;
        /** l1_dbus0_ovf_int_st : RO; bitpos: [4]; default: 0;
         *  The bit indicates the interrupt status of one of counters overflow that occurs in
         *  L1-DCache due to bus0 accesses L1-DCache.
         */
        uint32_t l1_dbus0_ovf_int_st:1;
        /** l1_dbus1_ovf_int_st : RO; bitpos: [5]; default: 0;
         *  The bit indicates the interrupt status of one of counters overflow that occurs in
         *  L1-DCache due to bus1 accesses L1-DCache.
         */
        uint32_t l1_dbus1_ovf_int_st:1;
        /** l1_dbus2_ovf_int_st : HRO; bitpos: [6]; default: 0;
         *  Reserved
         */
        uint32_t l1_dbus2_ovf_int_st:1;
        /** l1_dbus3_ovf_int_st : HRO; bitpos: [7]; default: 0;
         *  Reserved
         */
        uint32_t l1_dbus3_ovf_int_st:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} cache_l1_cache_acs_cnt_int_st_reg_t;

/** Type of l1_cache_acs_fail_int_ena register
 *  Cache Access Fail Interrupt enable register
 */
typedef union {
    struct {
        /** l1_icache0_fail_int_ena : R/W; bitpos: [0]; default: 0;
         *  The bit is used to enable interrupt of access fail that occurs in L1-ICache0 due to
         *  cpu accesses L1-ICache0.
         */
        uint32_t l1_icache0_fail_int_ena:1;
        /** l1_icache1_fail_int_ena : R/W; bitpos: [1]; default: 0;
         *  The bit is used to enable interrupt of access fail that occurs in L1-ICache1 due to
         *  cpu accesses L1-ICache1.
         */
        uint32_t l1_icache1_fail_int_ena:1;
        /** l1_icache2_fail_int_ena : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_fail_int_ena:1;
        /** l1_icache3_fail_int_ena : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_fail_int_ena:1;
        /** l1_dcache_fail_int_ena : R/W; bitpos: [4]; default: 0;
         *  The bit is used to enable interrupt of access fail that occurs in L1-DCache due to
         *  cpu accesses L1-DCache.
         */
        uint32_t l1_dcache_fail_int_ena:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_acs_fail_int_ena_reg_t;

