espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/cache_struct.h
/** Type of l2_ibus1_acs_nxtlvl_rd_cnt register
 *  L2-Cache bus1 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus1_nxtlvl_rd_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L2-Cache accesses external memory due
         *  to L1-ICache1 accessing L2-Cache due to bus1 accessing L1-ICache1.
         */
        uint32_t l2_ibus1_nxtlvl_rd_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus1_acs_nxtlvl_rd_cnt_reg_t;

/** Type of l2_ibus2_acs_hit_cnt register
 *  L2-Cache bus2 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus2_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when L1-ICache2 accesses L2-Cache due to
         *  bus2 accessing L1-ICache2.
         */
        uint32_t l2_ibus2_hit_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus2_acs_hit_cnt_reg_t;

/** Type of l2_ibus2_acs_miss_cnt register
 *  L2-Cache bus2 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus2_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when L1-ICache2 accesses L2-Cache due to
         *  bus2 accessing L1-ICache2.
         */
        uint32_t l2_ibus2_miss_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus2_acs_miss_cnt_reg_t;

/** Type of l2_ibus2_acs_conflict_cnt register
 *  L2-Cache bus2 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus2_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when L1-ICache2 accesses
         *  L2-Cache due to bus2 accessing L1-ICache2.
         */
        uint32_t l2_ibus2_conflict_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus2_acs_conflict_cnt_reg_t;

/** Type of l2_ibus2_acs_nxtlvl_rd_cnt register
 *  L2-Cache bus2 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus2_nxtlvl_rd_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L2-Cache accesses external memory due
         *  to L1-ICache2 accessing L2-Cache due to bus2 accessing L1-ICache2.
         */
        uint32_t l2_ibus2_nxtlvl_rd_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus2_acs_nxtlvl_rd_cnt_reg_t;

/** Type of l2_ibus3_acs_hit_cnt register
 *  L2-Cache bus3 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus3_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when L1-ICache3 accesses L2-Cache due to
         *  bus3 accessing L1-ICache3.
         */
        uint32_t l2_ibus3_hit_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus3_acs_hit_cnt_reg_t;

/** Type of l2_ibus3_acs_miss_cnt register
 *  L2-Cache bus3 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus3_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when L1-ICache3 accesses L2-Cache due to
         *  bus3 accessing L1-ICache3.
         */
        uint32_t l2_ibus3_miss_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus3_acs_miss_cnt_reg_t;

/** Type of l2_ibus3_acs_conflict_cnt register
 *  L2-Cache bus3 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus3_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when L1-ICache3 accesses
         *  L2-Cache due to bus3 accessing L1-ICache3.
         */
        uint32_t l2_ibus3_conflict_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus3_acs_conflict_cnt_reg_t;

/** Type of l2_ibus3_acs_nxtlvl_rd_cnt register
 *  L2-Cache bus3 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus3_nxtlvl_rd_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L2-Cache accesses external memory due
         *  to L1-ICache3 accessing L2-Cache due to bus3 accessing L1-ICache3.
         */
        uint32_t l2_ibus3_nxtlvl_rd_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus3_acs_nxtlvl_rd_cnt_reg_t;

/** Type of l2_dbus0_acs_hit_cnt register
 *  L2-Cache bus0 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus0_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when L1-DCache accesses L2-Cache due to
         *  bus0 accessing L1-DCache.
         */
        uint32_t l2_dbus0_hit_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus0_acs_hit_cnt_reg_t;

/** Type of l2_dbus0_acs_miss_cnt register
 *  L2-Cache bus0 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus0_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when L1-DCache accesses L2-Cache due to
         *  bus0 accessing L1-DCache.
         */
        uint32_t l2_dbus0_miss_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus0_acs_miss_cnt_reg_t;

/** Type of l2_dbus0_acs_conflict_cnt register
 *  L2-Cache bus0 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus0_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when L1-DCache accesses
         *  L2-Cache due to bus0 accessing L1-DCache.
         */
        uint32_t l2_dbus0_conflict_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus0_acs_conflict_cnt_reg_t;

/** Type of l2_dbus0_acs_nxtlvl_rd_cnt register
 *  L2-Cache bus0 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus0_nxtlvl_rd_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L2-Cache accesses external memory due
         *  to L1-DCache accessing L2-Cache due to bus0 accessing L1-DCache.
         */
        uint32_t l2_dbus0_nxtlvl_rd_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus0_acs_nxtlvl_rd_cnt_reg_t;

/** Type of l2_dbus0_acs_nxtlvl_wr_cnt register
 *  L2-Cache bus0 WB-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus0_nxtlvl_wr_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of write back when L1-DCache accesses L2-Cache due
         *  to bus0 accessing L1-DCache.
         */
        uint32_t l2_dbus0_nxtlvl_wr_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus0_acs_nxtlvl_wr_cnt_reg_t;

/** Type of l2_dbus1_acs_hit_cnt register
 *  L2-Cache bus1 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus1_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when L1-DCache accesses L2-Cache due to
         *  bus1 accessing L1-DCache.
         */
        uint32_t l2_dbus1_hit_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus1_acs_hit_cnt_reg_t;

